In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [3]:
df

          W         X         Y         Z
A  1.200092 -0.632269 -0.602581  0.947409
B  1.052109 -0.499742  0.286942  0.388043
C -0.142946 -0.465737  1.828434 -0.235709
D -0.601121  1.810719 -2.029237 -0.645347
E  0.806240 -0.928370  1.491946 -0.372499

In [4]:
df['W']

A    1.200092
B    1.052109
C   -0.142946
D   -0.601121
E    0.806240
Name: W, dtype: float64

In [5]:
df.W

A    1.200092
B    1.052109
C   -0.142946
D   -0.601121
E    0.806240
Name: W, dtype: float64

In [6]:
df[['W','Z']]

          W         Z
A  1.200092  0.947409
B  1.052109  0.388043
C -0.142946 -0.235709
D -0.601121 -0.645347
E  0.806240 -0.372499

In [7]:
df['baru'] = df['W'] + df['Y']

In [8]:
df

          W         X         Y         Z      baru
A  1.200092 -0.632269 -0.602581  0.947409  0.597511
B  1.052109 -0.499742  0.286942  0.388043  1.339051
C -0.142946 -0.465737  1.828434 -0.235709  1.685488
D -0.601121  1.810719 -2.029237 -0.645347 -2.630358
E  0.806240 -0.928370  1.491946 -0.372499  2.298186

In [9]:
df.drop('baru',axis=1)

          W         X         Y         Z
A  1.200092 -0.632269 -0.602581  0.947409
B  1.052109 -0.499742  0.286942  0.388043
C -0.142946 -0.465737  1.828434 -0.235709
D -0.601121  1.810719 -2.029237 -0.645347
E  0.806240 -0.928370  1.491946 -0.372499

In [10]:
df

          W         X         Y         Z      baru
A  1.200092 -0.632269 -0.602581  0.947409  0.597511
B  1.052109 -0.499742  0.286942  0.388043  1.339051
C -0.142946 -0.465737  1.828434 -0.235709  1.685488
D -0.601121  1.810719 -2.029237 -0.645347 -2.630358
E  0.806240 -0.928370  1.491946 -0.372499  2.298186

In [11]:
df.drop('baru',axis=1, inplace=True)

In [12]:
df

          W         X         Y         Z
A  1.200092 -0.632269 -0.602581  0.947409
B  1.052109 -0.499742  0.286942  0.388043
C -0.142946 -0.465737  1.828434 -0.235709
D -0.601121  1.810719 -2.029237 -0.645347
E  0.806240 -0.928370  1.491946 -0.372499

In [13]:
df.drop('E',axis=0)

          W         X         Y         Z
A  1.200092 -0.632269 -0.602581  0.947409
B  1.052109 -0.499742  0.286942  0.388043
C -0.142946 -0.465737  1.828434 -0.235709
D -0.601121  1.810719 -2.029237 -0.645347

In [14]:
df.loc['A']

W    1.200092
X   -0.632269
Y   -0.602581
Z    0.947409
Name: A, dtype: float64

In [15]:
df.iloc[2]

W   -0.142946
X   -0.465737
Y    1.828434
Z   -0.235709
Name: C, dtype: float64

In [16]:
df.loc['C','Z']

-0.23570908704820123

In [17]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  1.200092 -0.602581
B  1.052109  0.286942

In [18]:
df > 0

       W      X      Y      Z
A   True  False  False   True
B   True  False   True   True
C  False  False   True  False
D  False   True  False  False
E   True  False   True  False

In [19]:
df[df>0]

          W         X         Y         Z
A  1.200092       NaN       NaN  0.947409
B  1.052109       NaN  0.286942  0.388043
C       NaN       NaN  1.828434       NaN
D       NaN  1.810719       NaN       NaN
E  0.806240       NaN  1.491946       NaN

In [20]:
df[df['W']>0]

          W         X         Y         Z
A  1.200092 -0.632269 -0.602581  0.947409
B  1.052109 -0.499742  0.286942  0.388043
E  0.806240 -0.928370  1.491946 -0.372499

In [23]:
df[df['W']>0][['Y','X']]

          Y         X
A -0.602581 -0.632269
B  0.286942 -0.499742
E  1.491946 -0.928370

In [24]:
df[(df['W']>0) & (df['X'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [25]:
df[(df['W']>0) | (df['X'] > 0)]

          W         X         Y         Z
A  1.200092 -0.632269 -0.602581  0.947409
B  1.052109 -0.499742  0.286942  0.388043
D -0.601121  1.810719 -2.029237 -0.645347
E  0.806240 -0.928370  1.491946 -0.372499

In [26]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.200092 -0.632269 -0.602581  0.947409
1     B  1.052109 -0.499742  0.286942  0.388043
2     C -0.142946 -0.465737  1.828434 -0.235709
3     D -0.601121  1.810719 -2.029237 -0.645347
4     E  0.806240 -0.928370  1.491946 -0.372499

In [27]:
df["code"] = "IND JPN USA RSA IND".split()

In [28]:
df

          W         X         Y         Z code
A  1.200092 -0.632269 -0.602581  0.947409  IND
B  1.052109 -0.499742  0.286942  0.388043  JPN
C -0.142946 -0.465737  1.828434 -0.235709  USA
D -0.601121  1.810719 -2.029237 -0.645347  RSA
E  0.806240 -0.928370  1.491946 -0.372499  IND

In [29]:
df.set_index("code")

             W         X         Y         Z
code
IND   1.200092 -0.632269 -0.602581  0.947409
JPN   1.052109 -0.499742  0.286942  0.388043
USA  -0.142946 -0.465737  1.828434 -0.235709
RSA  -0.601121  1.810719 -2.029237 -0.645347
IND   0.806240 -0.928370  1.491946 -0.372499

In [30]:
df

          W         X         Y         Z code
A  1.200092 -0.632269 -0.602581  0.947409  IND
B  1.052109 -0.499742  0.286942  0.388043  JPN
C -0.142946 -0.465737  1.828434 -0.235709  USA
D -0.601121  1.810719 -2.029237 -0.645347  RSA
E  0.806240 -0.928370  1.491946 -0.372499  IND

In [31]:
df.set_index("code",inplace=True)

In [32]:
df

             W         X         Y         Z
code
IND   1.200092 -0.632269 -0.602581  0.947409
JPN   1.052109 -0.499742  0.286942  0.388043
USA  -0.142946 -0.465737  1.828434 -0.235709
RSA  -0.601121  1.810719 -2.029237 -0.645347
IND   0.806240 -0.928370  1.491946 -0.372499

In [33]:
dataLabels = ['G1','G1','G1','G2','G2','G2']
dataValue = [1,2,3,1,2,3]
data = list(zip(dataLabels,dataValue))
data = pd.MultiIndex.from_tuples(data)

In [34]:
list(zip(dataLabels,dataValue))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [35]:
data

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [37]:
df = pd.DataFrame(np.random.randn(6,2),index=data,columns=['A','B'])
df

             A         B
G1 1  0.335186  0.029200
   2 -0.813913  0.427277
   3  0.279999 -0.328426
G2 1 -0.916677  0.702612
   2  0.080493 -0.569208
   3 -2.123493 -1.329237

In [38]:
df.loc['G1']

          A         B
1  0.335186  0.029200
2 -0.813913  0.427277
3  0.279999 -0.328426

In [39]:
df.loc['G1'].loc[3]

A    0.279999
B   -0.328426
Name: 3, dtype: float64

In [40]:
df.index.names

FrozenList([None, None])

In [41]:
df.index.names = ['Group','Num']

In [42]:
df

                  A         B
Group Num
G1    1    0.335186  0.029200
      2   -0.813913  0.427277
      3    0.279999 -0.328426
G2    1   -0.916677  0.702612
      2    0.080493 -0.569208
      3   -2.123493 -1.329237

In [43]:
df.xs('G1')

            A         B
Num
1    0.335186  0.029200
2   -0.813913  0.427277
3    0.279999 -0.328426

In [44]:
df.xs(['G2',2])

A    0.080493
B   -0.569208
Name: (G2, 2), dtype: float64

In [45]:
df.xs(1,level='Num')

              A         B
Group
G1     0.335186  0.029200
G2    -0.916677  0.702612